app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 52]]

  def new
    @topic = Topic.find(params[:topic_id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]

  def create
     @topic = Topic.find(params[:topic_id])
     @post = @topic.posts.build(post_params)
     @post.user = current_user

     if @post.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hey hi ho"], ["body", "Are you there?"], ["created_at", "2017-01-08 18:36:24.777480"], ["updated_at", "2017-01-08 18:36:24.777480"]]

  def edit
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 51]]

  def update
    @post = Post.find(params[:id])
    @post.assign_attributes(post_params)

    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 51]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "afafsfsafdsds"], ["updated_at", "2017-01-13 22:19:44.486524"], ["id", 1]]

  def destroy
    @post = Post.find(params[:id])

    if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 52]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]