app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 16]]
---
   def show
       @topic = Topic.find(params[:id])

INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "A new topic"], ["description", "A new topic"], ["created_at", "2017-01-20 23:06:57.995039"], ["updated_at", "2017-01-20 23:06:57.995039"]]
---
   def create
       @topic = Topic.new
       @topic.name = params[:topic][:name]
       @topic.description = params[:topic][:description]
       @topic.public = params[:topic][:public]

       if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
---
   def edit
       @topic = Topic.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "topics" SET "name" = ?, "description" = ?, "public" = ?, "updated_at" = ? WHERE "topics"."id" = ?
---
   def update
       @topic = Topic.find(params[:id])
       @topic.assign_attributes(topic_params)


        if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 5]]
---
   def destroy
       @topic = Topic.find(params[:id])

        if @topic.destroy